686my686/MSPM0G3507-AutoCar/msp_test/MSPM0G_CAR_K230/empty.syscfg
TIMER2.$name             = "TIMER_1ms";
TIMER2.timerPeriod       = "1 ms";
TIMER2.timerClkSrc       = "MFCLK";
TIMER2.timerClkDiv       = 5;
TIMER2.interruptPriority = "3";
TIMER2.timerMode         = "PERIODIC_UP";
TIMER2.interrupts        = ["LOAD"];

UART1.$name                    = "UART_0";
UART1.enabledInterrupts        = ["RX"];
UART1.targetBaudRate           = 115200;
UART1.uartClkSrc               = "MFCLK";
UART1.peripheral.$assign       = "UART0";
UART1.peripheral.rxPin.$assign = "PA11";
UART1.peripheral.txPin.$assign = "PA10";
UART1.txPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric0";
UART1.rxPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric1";

UART2.$name                    = "UART_1";
UART2.enabledInterrupts        = ["RX"];
UART2.interruptPriority        = "2";
UART2.uartClkDiv               = "5";
UART2.peripheral.$assign       = "UART1";
UART2.peripheral.rxPin.$assign = "PA9";
UART2.peripheral.txPin.$assign = "PB4";
UART2.txPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric16";
UART2.rxPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric17";

UART3.$name                    = "UART_2";
UART3.enabledInterrupts        = ["RX"];
UART3.interruptPriority        = "2";
UART3.uartClkSrc               = "MFCLK";
UART3.targetBaudRate           = 115200;
UART3.peripheral.$assign       = "UART2";
UART3.peripheral.rxPin.$assign = "PB18";
UART3.peripheral.txPin.$assign = "PA23";
UART3.txPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric18";
UART3.rxPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric19";

UART4.$name                    = "UART_3";
UART4.enabledInterrupts        = ["RX"];
UART4.interruptPriority        = "2";
UART4.targetBaudRate           = 115200;
UART4.uartClkDiv               = "4";
UART4.peripheral.$assign       = "UART3";
UART4.peripheral.rxPin.$assign = "PA13";
UART4.peripheral.txPin.$assign = "PA26";
UART4.txPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric20";
UART4.rxPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric21";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
pinFunction4.peripheral.$suggestSolution           = "SYSCTL";
pinFunction4.peripheral.hfxInPin.$suggestSolution  = "PA5";
pinFunction4.peripheral.hfxOutPin.$suggestSolution = "PA6";
ADC121.peripheral.$suggestSolution                 = "ADC0";
Board.peripheral.$suggestSolution                  = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution         = "PA20";
Board.peripheral.swdioPin.$suggestSolution         = "PA19";
GPIO1.associatedPins[0].pin.$suggestSolution       = "PA17";
GPIO5.associatedPins[0].pin.$suggestSolution       = "PB9";
GPIO8.associatedPins[0].pin.$suggestSolution       = "PB13";
GPIO8.associatedPins[1].pin.$suggestSolution       = "PA31";
GPIO9.associatedPins[0].pin.$suggestSolution       = "PA15";
GPIO9.associatedPins[1].pin.$suggestSolution       = "PA30";
PWM2.peripheral.$suggestSolution                   = "TIMG7";
TIMER1.peripheral.$suggestSolution                 = "TIMG0";
TIMER2.peripheral.$suggestSolution                 = "TIMA1";
